RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_EMIOS.h
/*
** ###################################################################
**     Processor:           S32K344
**     Reference manual:    S32K3xx RM Rev.3
**     Version:             rev. 1.9, 2021-10-27
**     Build:               b211026
**
**     Abstract:
**         Peripheral Access Layer for S32K344
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2021 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K344_eMIOS.h
 * @version 1.9
 * @date 2021-10-27
 * @brief Peripheral Access Layer for S32K344_eMIOS
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K344_eMIOS_H_)  /* Check if memory map has not been already included */
#define S32K344_eMIOS_H_

#include "S32K344_COMMON.h"

/* ----------------------------------------------------------------------------
   -- eMIOS Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eMIOS_Peripheral_Access_Layer eMIOS Peripheral Access Layer
 * @{
 */

/** eMIOS - Size of Registers Arrays */
#define eMIOS_CH_UC_UC_COUNT                      24u

/** eMIOS - Register Layout Typedef */
typedef struct {
  __IO uint32_t MCR;                               /**< Module Configuration, offset: 0x0 */
  __I  uint32_t GFLAG;                             /**< Global Flag, offset: 0x4 */
  __IO uint32_t OUDIS;                             /**< Output Update Disable, offset: 0x8 */
  __IO uint32_t UCDIS;                             /**< Disable Channel, offset: 0xC */
  uint8_t RESERVED_0[16];
  union {                                          /* offset: 0x20 */
    struct {                                         /* offset: 0x20, array step: 0x20 */
      __IO uint32_t A;                                 /**< UC A 0..UC A 23, array offset: 0x20, array step: 0x20 */
      __IO uint32_t B;                                 /**< UC B 0..UC B 23, array offset: 0x24, array step: 0x20 */
      __IO uint32_t CNT;                               /**< UC Counter 0..UC Counter 23, array offset: 0x28, array step: 0x20 */
      __IO uint32_t C;                                 /**< UC Control 0..UC Control 23, array offset: 0x2C, array step: 0x20 */
      __IO uint32_t S;                                 /**< UC Status 0..UC Status 23, array offset: 0x30, array step: 0x20 */
      __IO uint32_t ALTA;                              /**< Alternate Address 0..Alternate Address 23, array offset: 0x34, array step: 0x20 */
      __IO uint32_t C2;                                /**< UC Control 2 0..UC Control 2 23, array offset: 0x38, array step: 0x20 */
      uint8_t RESERVED_0[4];
    } UC[eMIOS_CH_UC_UC_COUNT];
  } CH;
} eMIOS_Type, *eMIOS_MemMapPtr;

/** Number of instances of the eMIOS module. */
#define eMIOS_INSTANCE_COUNT                     (3u)

/* eMIOS - Peripheral instance base addresses */
/** Peripheral EMIOS_0 base address */
#define IP_EMIOS_0_BASE                          (0x40088000u)
/** Peripheral EMIOS_0 base pointer */
#define IP_EMIOS_0                               ((eMIOS_Type *)IP_EMIOS_0_BASE)
/** Peripheral EMIOS_1 base address */
#define IP_EMIOS_1_BASE                          (0x4008C000u)
/** Peripheral EMIOS_1 base pointer */
#define IP_EMIOS_1                               ((eMIOS_Type *)IP_EMIOS_1_BASE)
/** Peripheral EMIOS_2 base address */
#define IP_EMIOS_2_BASE                          (0x40090000u)
/** Peripheral EMIOS_2 base pointer */
#define IP_EMIOS_2                               ((eMIOS_Type *)IP_EMIOS_2_BASE)
/** Array initializer of eMIOS peripheral base addresses */
#define IP_eMIOS_BASE_ADDRS                      { IP_EMIOS_0_BASE, IP_EMIOS_1_BASE, IP_EMIOS_2_BASE }
/** Array initializer of eMIOS peripheral base pointers */
#define IP_eMIOS_BASE_PTRS                       { IP_EMIOS_0, IP_EMIOS_1, IP_EMIOS_2 }

/* ----------------------------------------------------------------------------
   -- eMIOS Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup eMIOS_Register_Masks eMIOS Register Masks
 * @{
 */

/*! @name MCR - Module Configuration */
/*! @{ */

